{"peer_review": {"employer": " Center For Inquiry IncCente Claimant", "claim no.": "709882756", "DOI": "09/23/2010", "examiner": " DONNA LAPOINT", "DOB": "02/10/1951", "review no.": " 5906103", "provider": "Michael Tworkowski", "no. of requests": " 0", "phone no.": "(716) 218-1000", "jurisdiction": " NY", "speciality": "Physicians", "level": " NY PAR Level 2", "review_type": " Prospective UR"}, "medical_records": {"treatment_requested": "Requested:72141: Magnetic resonance (eg, proton) imaging, spinal canal and contents, cervical; withoutcontrast material - MRI of the cervical spine97164: Re-evaluation of physical therapy established plan of care, requiring these components:An examination including a review of history and use of standardized tests and measures isrequired; and Revised plan of care using a standardized patient assessment instrument and/ormeasurable assessment of functional outcome Typically, 20 minutes are spent faceto-face withthe patient and/or family - Physical therapy for the cervical spine (2-3 sessions per week x 8weeks", "diagnosis": "Client Contact: Vera Mae Talplacido Peer Vendor: ExamWorks/NMRPhone:  Peer Vendor eMail: claytonlangley@mitchellcomFax:Email: Vera_Talplacido@gbtpacomHistory of Condition:Source/Criteria/Ref:New York Medical Treatment Guidelines /Citation:", "conslusion": "Client InstructionsGuideline Variance: Limited findings to support the need for repeat MRIIt is unclear how manyprior physical therapy sessions were completed or detailed, objective and comparative physicalexamination finding and documentation of patient's objective response to prior physicaltherapyDue to the absence of this information, medical necessity of this request is notestablishedThis request will be sent to peer review for further evaluationNYS WCB MTG Neck Injury C1b Magnetic Resonance Imaging (MRI)NYS WCB MTG Neck Injury, D9 Treatments, D9a Rehabilitation Therapy, D9ai Physical /Occupational Therapy, D9d Therapeutic ExercisePA Due Date/Time: 10/27/2022 5:00 PM CSTRequesting Provider Name/Specialty: Michael Tworkowski, PA Physicians AssistantCompensable (Accepted) Body Part/s: NECK, BACK, LEFT SHOULDER, BILATERAL KNEES- BURNS EXPIREDRequest:72141: Magnetic resonance (eg, proton) imaging, spinal canal and contents, cervical; withoutcontrast material - MRI of the cervical spine97164: Re-evaluation of physical therapy established plan of care, requiring these components:An examination including a review of history and use of standardized tests and measures isrequired; and Revised plan of care using a standardized patient assessment instrument and/ormeasurable assessment of functional outcome Typically, 20 minutes are spent faceto-face withthe patient and/or family - Physical therapy for the cervical spine (2-3 sessions per week x 8weeks"}}