{
  "peer_review": {
    "date_submitted": "10/27/2022",
    "due_date": "Due",
    "client_contact": " Joel Razon, RN ",
    "email": " Joel_Razon@gbtpa.com",
    "claiment": " DJABY DOUCOURE ",
    "employer": " CROSS COUNTRY",
    "claim no.": " 005157-001583-WC-01 ",
    "DOI": "03/09/2020",
    "examiner": " CHRISTINE LEVAN",
    "DOB": " 04/10/1973 ",
    "review no.": " 5913393",
    "provider": " ",
    "speciality": " Psychology ",
    "review_level": " NY PAR Level 2",
    "review_type": " Prospective UR"
  },
  "medical_records": {
    "treatment_requested": "Treatment 90837: Psychotherapy, 60 minutes with patient - Psychotherapy, 14 sessions - for mood",
    "diagnosis": "Diagnosis:Conclusion:Client InstructionsGuideline Variance: IW was referred for a psychological evaluation due to problems withdepression, anxiety, and sleeping difficulty, along with symptoms of postconcussion syndrome(PCS). The reported onset of these symptoms followed a work-related accident on 03/09/20.IW describes the incident as traumatic. He says that he never recover from the incident. Heunderwent surgery in his back (2022), neck (2021), and left knee (2020). He shares that hispain continues. He fears that he will need more surgery. He complains that he has memoryloss and cannot concentrate on what he tries to do and he reports that he is emotionallyaffected. He has difficulty sleeping because of pain and worries about the future. He sharesthat he gets easily irritable and tends to be impatient and angry. Overall, IW is experiencingfeelings of overwhelming, ruminative anxiety, and not feeling himself. He feels like he is not thesame person and he struggles daily. These symptoms continue to interfere with his dailyfunctioning. Per Beck Depression Inventory and Beck Anxiety Inventory, indicates that heconsciously admits to severe levels of clinical depression and he consciously admits high levelsof clinical anxiety accompanied by an inability to relax, and fear of the worst happening. Hecame transferred from Dr. Robins' office where he used to receive psychotherapy fordepression, anxiety, and PTSD.-- Unable to determine prior total Psychotherapy visit attendedand response to treatment. May exceeds recommended number of visits per guidelines.NYS WCB MTG - Work-Related Depression and Depressive Disorders-B.3.b.i CognitiveBehavioral Therapy (CBT)PA Due Date/Time: 10/28/2022 3:00PM CSTRequesting Provider Name/Specialty: Dr. Juraci Da Silva/PsychologyCompensable (Accepted) Body Part/s: left knee, Post-Concussion syndrome and depressionMOI: EE explains he was conducting a stripping operation on the east perimeter of the 4th floorwhen the panel fell on top of him causing pain to his left knee. IW states he does not wantmedical attention at this time only that it is sore and wants me to be aware of it.Request: 90837: Psychotherapy, 60 minutes with patient - Psychotherapy, 14 sessions - formood disorder and anxietyTreatment Request Details:DOS |DOS |Treatment Description CPT DeterminationStart {End TextDate /|DatePsychotherapy,60 minutes withpatient -Psychotherapy,14 sessions - formood disorderand anxietyyy 90837: 90837 |14ork Shodkcal Resien Ceba lamin omenLadNMR #746975 (Pre-Referral) Click here to printCommentsClient Due DateReferrerReferrer PhoneReferrer EmailClientTurnaround TypeDate CreatedReferral TypeLine of BusinessReview TypeReview LevelReview is AddendumReview TimingState of JurisdictionLast NameFirst NameClaim NumberGenderDate of BirthJob TitleDate of Disability/InjuryDiagnosis(es)Previous TreatmentReview PeriodSSNCase SummaryLocationEmployerStreetCity10/28/2022 3:00 PMCDTStarling, Debra(615) 778-5135debra_starling@gbtpa.comGALL-WC-GALL1 - GALLAGHER BASSETT - PEER REVIEWSStandard10/27/2022 3:37 PMCDTPeer ReviewWork CompMedical NecessityNY PAR Level 2Prospective URNYDoucoureDjaby005157-001583-WC-01Unknown4/10/19733/9/2020F06.30 Mood disorder due to known physiological condition, unspecified; FO6.4 Anxiety disorder duto known physiological condition; --F07.81 Post concussional syndromeGuideline Variance: IW was referred for a psychological evaluation due to problems with depressioranxiety, and sleeping difficulty, along with symptoms of postconcussion syndrome (PCS). Thereported onset of these symptoms followed a work-related accident on 03/09/20. IW describes theincident as traumatic. He says that he never recover from the incident. He underwent surgery in hisback (2022), neck (2021), and left knee (2020). He shares that his pain continues. He fears that hewill need more surgery. He complains that he has memory loss and cannot concentrate on what hetries to do and he reports that he is emotionally affected. He has difficulty sleeping because of painand worries about the future. He shares that he gets easily irritable and tends to be impatient andangry. Overall, IW is experiencing feelings of overwhelming, ruminative anxiety, and not feelinghimself. He feels like he is not the same person and he struggles daily. These symptoms continue teinterfere with his daily functioning. Per Beck Depression Inventory and Beck Anxiety Inventory,indicates that he consciously admits to severe levels of clinical depression and he consciously admihigh levels of clinical anxiety accompanied by an inability to relax, and fear of the worst happening.He came transferred from Dr. Robins' office where he used to receive psychotherapy for depressioranxiety, and PTSD.-- Unable to determine prior total Psychotherapy visit attended and response totreatment. May exceeds recommended number of visits per guidelines. NYS WCB MTG Work-Related Depression and Depressive Disorders-B.3.b.i Cognitive Behavioral Therapy (CBT)PA DueDate/Time: 10/28/2022 3:00PM CSTRequesting Provider Name/Specialty: Dr. Juraci DaSilva/PsychologyCompensable (Accepted) Body Part/s: left knee, Post-Concussion syndrome anddepressionMOI: EE explains he was conducting a stripping operation on the east perimeter of the 4floor when the panel fell on top of him causing pain to his left knee. IW states he does not wantmedical attention at this time only that it is sore and wants me to be aware of it.Request: 90837:Psychotherapy, 60 minutes with patient - Psychotherapy, 14 sessions - for mood disorder and anxieHUNTER ROBERTS CONSTRUCTION GRP -CCIP - 005157CROSS COUNTRY CONSTRUCTIONStateZip CodeContact Provider(s) NoProvider Specialty PsychologyProvider Phone Number (917) 667-9070Number of Questions 1Question 01Special RequirementsAttachmentsClient UploadsNo Document AttachedDocumentation Reviewedref.DO-00-2169-510_10-18-2022-21-23 2.pdfref.DO-00-2169-512_10-18-2022-21-23 1.pdfref.R.docReportsNo Document AttachedSTATE | Compensation MTG CONFIRMATIONBoardListed below are details of a Prior Authorization Request (PAR) that was submitted to request confirmation that theproposed treatment(s)/test(s) are based on a correct application of the Medical Treatment Guidelines. Uponidentification of the claim administrator, they will be required to respond within 8 business days; parties will be notifiedof the outcome.CLAIM INFORMATIONWCB Case # Date of Injury Claim Admin Claim #G2718838 03/09/2020 005157001583WC01Patient Name Doucoure, DjabyAddress 1310 SHERIDAN AVE#6GBronx, NY 104561308SSN XXX-XX-7893 DOB 04/10/1973 Gender MaleEmployer Name CROSS COUNTRY CONSTRUCTION LLCAddress 5W MAIN ST STE 103ELMSFORD, NY 105232449Insurer Name_ Arch Indemnity Insurance Co. Insurer ID W036885Address 300 PLAZA THREE 3RD FLOORJERSEY CITY, NJ 07311-1107Claim Admin Name_ Gallagher Bassett Services Inc Claim Admin ID 1100033AddressHEALTH CARE PROVIDER INFORMATIONName __ Da Silva, JuraciAddress 55 West 39th Street, Suite 305New York, NY 10018Type PsychologistWCB Auth # S18633-8 NPI 1255774766MG1-L1 05/22 Page 1 of 2 PAR ID PA-00-0619-815PRIOR AUTHORIZATION REQUEST DETAILS1. | Body Part MTG Reference Code and Description CPT Code and DescriptionOther Depression - B.3.b.i: Treatment - Cognitive 90837: Psychotherapy, 60 minutesBehavioral Therapy (CBT) with patientSTATEMENT OF MEDICAL NECESSITY / SUPPORTING MEDICAL DOCUMENTATIONStatement of Medical Necessity: Please see attached detail evaluation.Supporting documentation was provided as a part of this request.Supporting documentation was provided as a part of this request.PROVIDER’S ATTESTATIONBy submission of this request for prior authorization, | certify that my statements are true and correct, and | do not have asubstantially similar request pending.Provider Name Da Silva, Juraci Date 10/18/2022MG1-L1 05/22 Page 2 of 2 PAR ID PA-00-0619-815M DA SILIAERVJPSYCHOLOGICAL SERVICES55 West 39\" Street Suite 305, NYC, 10018 and 91-31 Queen Bly. Suite 308, Elmhursrt, NY 11373Phone: (917) 677-9070 e-Fax: (917) 725-8044CLINICAL PSYCHOLOGICAL EVALUATIONCONFIDENTIALPatient’s (Pt) Name: DJABY DOUCOUREDate of Birth: 04/10/73Date of the Evaluation: 10/11/22Date of the Injury: 03/09/20WCB Claim: G2718838 — 005157001583 WCO1This report is confidential, and discretion must be exercised in disclosing the information hereinto any person, including the patient.BACKGROUND INFORMATION:1. Identification and Purpose for Evaluation:Mr. Doucoure is a 49-year-old male who was referred for a psychological evaluation dueto problems with depression, anxiety, and sleeping difficulty, along with symptoms of post-concussion syndrome (PCS). The reported onset of these symptoms followed a work-relatedaccident on 03/09/20. This evaluation was done in person at the Manhattan office.2. Accident DescriptionOn the above-mentioned date, Mr. Doucoure was working in construction when awood/metal penal structure fell on him. He fell on the ground but is not sure if he lostconsciousness. He shares that he was taken to the medical room at the construction site but astime passed the pain intensified and he went to the doctor. He reports injuries in his back, neck,and left knee. He describes the incident as traumatic. He says that he never recover from theincident. He underwent surgery in his back (2022), neck (2021), and left knee (2020). He sharesthat his pain continues. He fears that he will need more surgery. He complains that he hasmemory loss and cannot concentrate on what he tries to do. He will start cognitive rehabilitation,with Dr. Busichio. He still goes to physical therapy. Since the accident, he reports that he isemotionally affected. He takes pain medication when needed.Mr. Doucoure’s past medical history is unremarkable; there are no prior head injuriesand/or loss of consciousness or any other emotional difficulties that would account for thesesymptoms. He never received psychological treatment before the accident. He came transferredfrom Dr. Robins’ office where he used to receive psychotherapy for depression, anxiety, andPTSD. He denied the use of alcohol and/or other substances. He shares that he was involved in acar accident in 2017 when he used to work as a taxi driver, and he injured his right shoulder. Mr.Doucoure was born in West Africa and lived in the U.S since 1997. He has ten children, fromJM DA SILIACAL SERVPSYCHOLOGICAL SERVICES55 West 39\" Street Suite 305, NYC, 10018 and 91-31 Queen Bly. Suite 308, Elmhursrt, NY 11373Phone: (917) 677-9070  e-Fax: (917) 725-8044two relationships (ages from 21 to 2.5-year-old). His wife helps with his ADLs. He completedhigh school. He has been unable to return to work.3. Test Session BehaviorMr. Doucoure arrived alone and on time for the test session. He took a taxi to my office.His appearance was neat. He wore a mask, and his temperature was measured per COVID-19regulations. He spoke in English, and his comprehension was judged to be intact for the taskinstructions presented to him. He was cooperative, and rapport was easily established.4. Current SymptomsFollowing the accident, Mr. Doucoure kept good eye contact and expresses that he needshelp. Mr. Doucoure reports he has difficulty sleeping because of pain and worries about thefuture. He shares that he gets easily irritable and tends to be impatient and angry. He says that heused to have nightmares and flashbacks about the accident but that now he is doing better. Hefeels very bad that he cannot be active and do things as he used to. He feels like he is failing hisfamily. He used t work hard and supports his family and now all changed. He says that he is tiredto stay home and going o doctor’s appointments. He reports low energy and has difficulty gettingengaged in activities. He shared that he feels very frustrated, as his life is very uncertain andunstable. He feels stuck in life and says that he did not ask for this or expect this.Overall, Mr. Doucoure is experiencing feelings of overwhelming, ruminative anxiety, andnot feeling himself. He feels like he is not the same person and he struggles daily. He deniessuicidal thoughts or plans. These symptoms continue to interfere with his daily functioning. Hewas referred for a psychological evaluation to continue his psychological care.A brief Interviewing for Mental Status (BIMS) was administered.Mr. Doucoure is oriented x 3 (time, place, person), presents neatly dressed, and has goodinterpersonal relatedness, and a good attitude towards the therapist.Mr. Doucoure’s speech is coherent; his latency of response is mostly soft. His mood isanxious and sometimes depressed; his affect is appropriate to his mood: mostly constricted. Hisvoice is most expressive, and his vocabulary is polysyllabic.Mr. Doucoure’s thought processes are seen to be logical and relevant, showing noevidence of delusions or hallucinations. Pt.’s judgment and insight seem fair. His immediate,recent, and remote memory all appear to be slightly affected by his PCS symptoms at this time.Mr. Doucoure’s impulse control is fair. His social/occupational/vocational functioning isall fair.Doucoure, DjabyJM DA SILIAERVPSYCHOLOGICAL SERVICES55 West 39\" Street Suite 305, NYC, 10018 and 91-31 Queen Bly. Suite 308, Elmhursrt, NY 11373Phone: (917) 677-9070  e-Fax: (917) 725-8044TESTS ADMINISTERED: (The following tests were selected step-wise based on a combinationof the patient’s condition, outcomes of the previous testing, and clinical indication. Besidesconfirming differential diagnoses from various points of view, the tests give invaluableinformation for effective treatment planning).1. Beck Depression Inventory (BDI-2)2. Beck Anxiety Inventory (BAI)3. The Beck Hopelessness Scale (BHS)4. Posttraumatic Stress Disorder Checklist (PCL-5)5. Pain Self-Efficacy Questionnaire (PSEQ)6. Quality of Life Inventory (QLD)7. Miller Forensic Assessment of Symptoms Test (M-Fast)8. Clinical InterviewTEST RESULTS:1. Beck Depression Inventory BDI-IIBeck Depression Inventory has become one of the most clinically accepted instruments forassessing the severity of depression in diagnosed patients and for detecting levels of consciouslyadmitted depression regardless of the clinical population. The BDI-II was developed as anindicator of the presence and degree of depressive symptoms consistent with DSM-V.Mr. Doucoure’s score of 50 indicates that he consciously admits to severe levels of clinicaldepression. No suicidal thoughts or plans were mentioned at this time.2. Beck Anxiety Inventory (BAI)The BAI consists of twenty-one questions about how the subject has been feeling in the lastmonth, expressed as common symptoms of anxiety (such as numbness and tingling, sweating notdue to heat, and fear of the worst happening). Anxiety can be thought of as having severalcomponents, including cognitive, somatic, affective, and behavioral components.Mr. Doucoure’s score of 30 indicates that he consciously admits high levels of clinicalanxiety accompanied by an inability to relax, and fear of the worst happening.3. The Beck Hopelessness Scale (BHS)The BHS is a 20-item developed to measure three major aspects of hopelessness: feelingsabout the future, loss of motivation, and expectations. Mr. Doucoure’s scores of 10 showmoderate to severe pessimism and negative attitudes about the future.Doucoure, DjabyJM DA SILIACAL SERVPSYCHOLOGICAL SERVICES55 West 39\" Street Suite 305, NYC, 10018 and 91-31 Queen Bly. Suite 308, Elmhursrt, NY 11373Phone: (917) 677-9070  e-Fax: (917) 725-80444. Posttraumatic Stress Disorder Checklist (PCL-5)The PCL-S5 is a 20-item self-report checklist of PTSD symptoms based closely on theDSM-V criteria. Respondents rate each item from 0 (\"not at all\") to 4 (\"extremely\") to indicatethe degree to which they have been bothered by that particular symptom over the past month.Typically, it is optimal to assess traumatic event exposure. A total score of 33 or higher suggeststhe patient may benefit from PTSD treatment.Overall, Mr. Doucoure’s score of 58 indicates significant traumatic event sequelae.Please note, even though he might have suffered from PTSD before, it seems that his symptomsgot better.5. Pain Self-Efficacy Questionnaire (PSEPSEQ assesses patients’ views of their ability to manage their pain. The ten items assess howconfident patients are that they can do things at present despite the pain. It covers a range offunctions, including house chores, socializing, work, and coping with pain without medication.The scores range from 0 to 60; the higher the score, the better the prognostic.A score of 19 indicates that Mr. Doucoure has a fair self-efficacy belief; which means that heis somehow confident in his ability to manage the pain.6. Quality of Life Invento LIThe Quality of life inventory is 33 items for assessing patients’ well-being and lifesatisfaction. Mr. Doucoure’s responses indicated he was not very satisfied with his life overall.He endorsed several items of importance to him, which included health, medical care, amount ofpain, amount of energy, capacity to help self, control over own life, life longevity, family health,children, family happiness, sexual life, partner, friendships, emotional support, responsibilities,usefulness to others, amount of worries in life, neighborhood, home or residence, employment,education, finances, have fun, a chance for a happy future, peace of mind, faith, meeting goals,overall happiness, life satisfaction, personal appearance, and self in general. He feels veryfrustrated, as he cannot achieve daily goals.8. Structured Inventory of Malingered Symptomatology (SIMS-TM)The SIMS-TM is a 75 items test that assesses five distinct areas. This test is a multi-axial,self-administered measure developed to serve as a screening tool for the detection of feigned orexaggerated psychiatric and cognitive disturbance across a variety of clinical and forensicsettings. The two relevant areas for the psychological scope are Psychoses and AffectiveDisorders. Mr. Doucoure scored 2 (cut off >1 to 2) on the Psychosis scale and 5 (cut off >5 to 6)in the Affective Disorders, showing no psychological symptoms, exaggeration, or malingering.Doucoure, DjabyJM DA SILIACAL SERVPSYCHOLOGICAL SERVICES55 West 39\" Street Suite 305, NYC, 10018 and 91-31 Queen Bly. Suite 308, Elmhursrt, NY 11373Phone: (917) 677-9070  e-Fax: (917) 725-80448. Clinical Interviews.Findings from the interviews themselves corroborate the testing hypotheses. Moreover, Mr.Doucoure’s reaction to the stress of the accident, as reported in interviews, emerges as acausative factor of present debility.DISCUSSION OF TEST RESULTS:Mr. Doucoure appears to be presently functioning on the average native endowmentrange of cognitive intelligence. Mr. Doucoure’s attention, concentration, and memoryfunctioning all seem to be slightly affected. Responses to BDI-2, BAI, PCL-5, M-Fast, and QLIcombined with a clinical interview, support underlying processes of depression and anxiety in anon-psychotic patient.DIAGNOSTIC IMPRESSION:(F06.30) Mood Disorder due to Medical Condition(F06.4) Anxiety Disorder Due to the medical condition(F07.81) Post Concussion SyndromeWith a reasonable degree of certainty, Mr. Doucoure’s psychological condition isconsequentially related to injuries sustained in a work-related accident that occurred on03/09/20. From a psychological point of view, he has a marked temporary disability of 75%at this time.RECOMMENDATIONS:The following psychological treatment is recommended: The course of treatment should be firstdirected toward his mood disorder and anxiety. Once the recommended treatment ends heshould be assessed for PTSD.14 sessions of psychotherapy for Mood Disorder and Anxiety: Mr. Doucoure should begiven the benefit of a course in Cognitive Behavior Therapy (CBT); Acceptance CommitmentTherapy (ACT); and the use of Mindfulness Exercises. This line of therapy is directed towardshoring up Pt’s sense of self, helping Mr. Doucoure to cope with feelings of helplessness andsymptoms of depression and anxiety; teaching cognitive and behavioral coping skills (e.g.,cognitive restructuring, activity pacing, mood check, etc.); as well as practice and consolidationof coping skills (e.g., pain and anger management).Doucoure, DjabyJM DA SILIARVPSYCHOLOGICAL SERVICES55 West 39\" Street Suite 305, NYC, 10018 and 91-31 Queen Bly. Suite 308, Elmhursrt, NY 11373Phone: (917) 677-9070 e-Fax: (917) 725-8044Ms. Doucoure will be monitored in psychotherapy and re-evaluated after therecommended course of treatment is completed. The patient will be referred to a psychiatrist forpsychotropic medication if indicated.PROGNOSIS: GuardedRespectfully Submitted,SeJuraci Da Silva, M.A., Ph.D (NYS # 018633-1)Doucoure, Djaby"
  },
  "nmr_pre_refferal": {
    "client_due_date": "Standard",
    "referrer": "10/27/2022 3:37 PMCDT",
    "referrer_phone": "Peer Review",
    "referrer_email": "Work Comp",
    "client_data": "Medical Necessity",
    "turn_around_type": "NY PAR Level 2",
    "date_created": "Prospective UR",
    "referral_type": "NY",
    "line_of_business": "Doucoure",
    "review_type": "Djaby",
    "review_level": "005157-001583-WC-01",
    "review_timing": "4/10/1973",
    "state_of_jurisdiction": "3/9/2020",
    "lastname": "F06.30 Mood disorder due to known physiological condition, unspecified; FO6.4 Anxiety disorder du",
    "firstname": "to known physiological condition; --F07.81 Post concussional syndrome",
    "claim_number": "Guideline Variance: IW was referred for a psychological evaluation due to problems with depressior",
    "gender": "anxiety, and sleeping difficulty, along with symptoms of postconcussion syndrome (PCS). The",
    "DOB": "reported onset of these symptoms followed a work-related accident on 03/09/20. IW describes the",
    "date_of_disability/injury": "back (2022), neck (2021), and left knee (2020). He shares that his pain continues. He fears that he",
    "case_summary": "NMR #746975 (Pre-Referral) Click here to printCommentsClient Due DateReferrerReferrer PhoneReferrer EmailClientTurnaround TypeDate CreatedReferral TypeLine of BusinessReview TypeReview LevelReview is AddendumReview TimingState of JurisdictionLast NameFirst NameClaim NumberGenderDate of BirthJob TitleDate of Disability/InjuryDiagnosis(es)Previous TreatmentReview PeriodSSNCase Summary"
  },
  "prior_auth_request": {
    "claim_information": {
      "patient_name": "Doucoure, Djaby",
      "address": "Address 1310 SHERIDAN AVE#6G Bronx, NY 104561308 ",
      "DOB": ""
    },
    "employer_data": {
      "name": "",
      "address": "5W MAIN ST STE 103 ELMSFORD, NY 105232449 "
    },
    "insurer": {
      "insurer_name": "Name_ Arch Indemnity Insurance Co. ",
      "insurer_id": "W036885"
    }
  }
}
